
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Страница вопроса · Toster Extension</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-vuejs/vue.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="questions-list.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://github.com/toster-extension/toster-extension/issues/new?assignees=yarkovaleksei&labels=feature&template=-----------.md&title=" target="_blank" class="custom-link">Предложить фичу</a>
        </li>
    
        
        <li>
            <a href="https://github.com/toster-extension/toster-extension/issues/new?assignees=yarkovaleksei&labels=bug&template=------.md&title=" target="_blank" class="custom-link">Сообщить о баге</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../developers.html">
            
                <a href="../developers.html">
            
                    
                    Разработчику
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                    Возможности
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="2.1.1" data-path="question-page.html">
            
                <a href="question-page.html">
            
                    
                    Страница вопроса
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="questions-list.html">
            
                <a href="questions-list.html">
            
                    
                    Список вопросов
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="top-24-questions-list.html">
            
                <a href="top-24-questions-list.html">
            
                    
                    Список вопросов ТОП 24
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.4" data-path="hide-escess.html">
            
                <a href="hide-escess.html">
            
                    
                    Скрыть лишнее
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.5" data-path="notifications.html">
            
                <a href="notifications.html">
            
                    
                    Уведомления
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.6" data-path="preview.html">
            
                <a href="preview.html">
            
                    
                    Превью
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.7" data-path="user.html">
            
                <a href="user.html">
            
                    
                    Пользователь
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.8" data-path="black-lists.html">
            
                <a href="black-lists.html">
            
                    
                    Черные списки
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.9" data-path="others.html">
            
                <a href="others.html">
            
                    
                    Разное
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../special-features.html">
            
                <a href="../special-features.html">
            
                    
                    Специальные возможности
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../install.html">
            
                <a href="../install.html">
            
                    
                    Установка
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="4.1.1" data-path="../install.html">
            
                <a href="../install.html#google-chrome">
            
                    
                    Google Chrome
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.2" data-path="../install.html">
            
                <a href="../install.html#firefox">
            
                    
                    Firefox
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.3" data-path="../install.html">
            
                <a href="../install.html#opera">
            
                    
                    Opera
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Страница вопроса</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435;-&#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43A;-&#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x438;-&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;-&#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;">&#x41E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43A; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x438; &quot;&#x421;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;&quot;</h2>
<p><strong>&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; <kbd>Ctrl+Enter</kbd> &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; &#x444;&#x43E;&#x440;&#x43C;&#x44B;</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x435;&#x43C; &#x441;&#x43E;&#x447;&#x435;&#x442;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448; <kbd>Ctrl+Enter</kbd>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x435; &#x442;&#x44F;&#x43D;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x43C;&#x44B;&#x448;&#x44C;&#x44E;. &#x414;&#x43B;&#x44F; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x44F;, &#x447;&#x442;&#x43E; &#x43E;&#x43F;&#x446;&#x438;&#x44F; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x430;, &#x432; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x435; &#x43F;&#x43E;&#x43B;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D; &#x43F;&#x43B;&#x44D;&#x439;&#x441;&#x445;&#x43E;&#x43B;&#x434;&#x435;&#x440;.</p>
<p>&#x421;&#x43E;&#x447;&#x435;&#x442;&#x430;&#x43D;&#x438;&#x435; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x448; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;&#x445; &#x43A; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x443;, &#x432; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;&#x445; &#x43A; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x443; &#x438; &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x435; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430; &#x43D;&#x430; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;.</p>
<p><img src="../images/screenshots/ctrl-enter.png" alt=""></p>
<hr>
<p><strong>&#x421;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x44C; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x443; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;/&#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x434;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438;</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x44C; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x43F;&#x43E;&#x43B;&#x435; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x434;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; &#x444;&#x43E;&#x440;&#x43C;&#x44B;.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x412;&#x44B; &#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x44B;&#x439; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x438; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x43B;&#x438; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x443;. &#x420;&#x430;&#x43D;&#x44C;&#x448;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x431;&#x44B;&#x43B; &#x431;&#x44B; &#x43F;&#x43E;&#x442;&#x435;&#x440;&#x44F;&#x43D;, &#x43D;&#x43E; &#x441; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43E;&#x43F;&#x446;&#x438;&#x435;&#x439; &#x43E;&#x43D; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;, &#x43F;&#x43E;&#x43A;&#x430; &#x412;&#x44B; &#x435;&#x433;&#x43E; &#x43D;&#x435; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x435;.</p>
<p>&#x421;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;&#x445; &#x43A; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x443;, &#x432; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;&#x445; &#x43A; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x443; &#x438; &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x435; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430; &#x43D;&#x430; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;.</p>
<p><img src="../images/screenshots/save-text.png" alt=""></p>
<hr>
<p><strong>&#x41E;&#x431;&#x43E;&#x440;&#x430;&#x447;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x43A;&#x43E;&#x434;&#x430; &#x432; &#x441;&#x43F;&#x43E;&#x439;&#x43B;&#x435;&#x440;</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43E;&#x431;&#x43E;&#x440;&#x430;&#x447;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x43A;&#x43E;&#x434;&#x430; &#x432; &#x441;&#x43F;&#x43E;&#x439;&#x43B;&#x435;&#x440; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;.</p>
<p>&#x422;&#x430;&#x43A;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x44B;&#x435; &#x444;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x43A;&#x43E;&#x434;&#x430; &#x431;&#x443;&#x434;&#x443;&#x442; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x441;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x44B; &#x43F;&#x440;&#x438; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x438; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;, &#x447;&#x442;&#x43E; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x43E;&#x431;&#x43B;&#x435;&#x433;&#x447;&#x430;&#x435;&#x442; &#x432;&#x43E;&#x441;&#x43F;&#x440;&#x438;&#x44F;&#x442;&#x438;&#x435; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x438; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x44E; &#x43F;&#x43E; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;.</p>
<hr>
<p><strong>&#x412;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x43D;&#x43E;&#x448;&#x438;&#x440;&#x438;&#x43D;&#x43D;&#x44B;&#x439; &#x448;&#x440;&#x438;&#x444;&#x442; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x434;&#x430; &#x432; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;&#x445;/&#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;&#x445;/&#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;&#x445;</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442; &#x43C;&#x43E;&#x43D;&#x43E;&#x448;&#x438;&#x440;&#x438;&#x43D;&#x43D;&#x44B;&#x439; &#x448;&#x440;&#x438;&#x444;&#x442; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x434;&#x430;.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x44F; &#x43F;&#x440;&#x438;&#x432;&#x44B;&#x43A; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x441; &#x448;&#x440;&#x438;&#x444;&#x442;&#x43E;&#x43C; Fira Code &#x438; &#x43C;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x44B;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x448;&#x440;&#x438;&#x444;&#x442;&#x43E;&#x43C;.</p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;&#x445; &#x43A; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x443;, &#x432; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x44F;&#x445; &#x43A; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x443; &#x438; &#x432; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;&#x445; &#x43D;&#x430; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;.</p>
<p>&#x41E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434;:<br>
<img src="../images/screenshots/monospace-font-before.png" alt=""></p>
<p>&#x421; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43E;&#x43F;&#x446;&#x438;&#x435;&#x439;:<br>
<img src="../images/screenshots/monospace-font-after.png" alt=""></p>
<hr>
<p><strong>&#x41E;&#x442;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438; &#x441;&#x43E; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x432; &#x43D;&#x43E;&#x432;&#x43E;&#x439; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x435;</strong></p>
<p>&#x41D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x432;&#x441;&#x435;&#x43C; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430;&#x43C; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>target=&quot;_blank&quot;</code>.</p>
<p>&#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x43C; &#x43F;&#x43E; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x435; &#x438;&#x437; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x438;&#x43B;&#x438; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;, &#x442;&#x43E; &#x43E;&#x43D;&#x430; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x43D;&#x43E;&#x432;&#x43E;&#x439; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x435;.</p>
<hr>
<p><strong>&#x421;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x431;&#x43B;&#x43E;&#x43A; &quot;&#x41F;&#x43E;&#x445;&#x43E;&#x436;&#x438;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B;&quot;</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x441;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x431;&#x43B;&#x43E;&#x43A; &quot;&#x41F;&#x43E;&#x445;&#x43E;&#x436;&#x438;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B;&quot;.</p>
<p><img src="../images/screenshots/hide-related-questions.png" alt=""></p>
<hr>
<p><strong>&#x421;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x443; &quot;&#x41E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;&#x43C;&quot; (&#x434;&#x43B;&#x44F; &#x447;&#x443;&#x436;&#x438;&#x445; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;)</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x441;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &quot;&#x41E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;&#x43C;&quot; (&#x434;&#x43B;&#x44F; &#x447;&#x443;&#x436;&#x438;&#x445; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;).</p>
<p><img src="../images/screenshots/remove-button.png" alt=""></p>
<hr>
<p><strong>&#x41F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x43C;&#x435;&#x441;&#x442;&#x430;&#x43C;&#x438; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &quot;&#x41E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;&#x43C;&quot; &#x438; &quot;&#x41D;&#x440;&#x430;&#x432;&#x438;&#x442;&#x441;&#x44F;&quot;</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442; &#x43C;&#x435;&#x441;&#x442;&#x430;&#x43C;&#x438; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &quot;&#x41E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;&#x43C;&quot; &#x438; &quot;&#x41D;&#x440;&#x430;&#x432;&#x438;&#x442;&#x441;&#x44F;&quot;.</p>
<p><img src="../images/screenshots/swap-buttons.png" alt=""></p>
<hr>
<p><strong>&#x41E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x442;&#x44C; &#x437;&#x430;&#x433;&#x43B;&#x443;&#x448;&#x43A;&#x443;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441; &#x441;&#x43A;&#x440;&#x44B;&#x442; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x447;&#x451;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x430;</strong></p>
<p>&#x41E;&#x43F;&#x446;&#x438;&#x44F; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x437;&#x430;&#x433;&#x43B;&#x443;&#x448;&#x43A;&#x443; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x430;&#x432;&#x442;&#x43E;&#x440; &#x43B;&#x438;&#x431;&#x43E; &#x43E;&#x434;&#x438;&#x43D; &#x438; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x435;&#x433;&#x43E;&#x432; &#x432; &#x447;&#x451;&#x440;&#x43D;&#x43E;&#x43C; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x435;. &#x422;&#x430;&#x43A;&#x438;&#x435; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x441;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x438;&#x437; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x43E;&#x432;, &#x43D;&#x43E; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B; &#x43F;&#x43E; &#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x439; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x435;.</p>
<p><img src="../images/screenshots/hidden-stub-by-author.png" alt=""></p>
<p><img src="../images/screenshots/hidden-stub-by-tag.png" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Возможности">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="questions-list.html" class="navigation navigation-next " aria-label="Next page: Список вопросов">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Страница вопроса","level":"2.1.1","depth":2,"next":{"title":"Список вопросов","level":"2.1.2","depth":2,"path":"features/questions-list.md","ref":"features/questions-list.md","articles":[]},"previous":{"title":"Возможности","level":"2.1","depth":1,"path":"features/index.md","ref":"features/index.md","articles":[{"title":"Страница вопроса","level":"2.1.1","depth":2,"path":"features/question-page.md","ref":"features/question-page.md","articles":[]},{"title":"Список вопросов","level":"2.1.2","depth":2,"path":"features/questions-list.md","ref":"features/questions-list.md","articles":[]},{"title":"Список вопросов ТОП 24","level":"2.1.3","depth":2,"path":"features/top-24-questions-list.md","ref":"features/top-24-questions-list.md","articles":[]},{"title":"Скрыть лишнее","level":"2.1.4","depth":2,"path":"features/hide-escess.md","ref":"features/hide-escess.md","articles":[]},{"title":"Уведомления","level":"2.1.5","depth":2,"path":"features/notifications.md","ref":"features/notifications.md","articles":[]},{"title":"Превью","level":"2.1.6","depth":2,"path":"features/preview.md","ref":"features/preview.md","articles":[]},{"title":"Пользователь","level":"2.1.7","depth":2,"path":"features/user.md","ref":"features/user.md","articles":[]},{"title":"Черные списки","level":"2.1.8","depth":2,"path":"features/black-lists.md","ref":"features/black-lists.md","articles":[]},{"title":"Разное","level":"2.1.9","depth":2,"path":"features/others.md","ref":"features/others.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["edit-link","github","theme-vuejs@git+https://github.com/pearofducks/gitbook-plugin-theme-vuejs.git","-fontsettings"],"root":"./","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"edit-link":{"label":"Изменить страницу","base":"https://github.com/toster-extension/toster-extension/tree/master/gitbook"},"github":{"url":"https://github.com/toster-extension/toster-extension/"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-vuejs":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"appName":"Toster Extension","appNameLower":"toster-extension","appVersion":"2.3.4","chromeLink":"https://chrome.google.com/webstore/detail/toster-extension/edbifjhhbolcnccchgdenjnlidcoadae","firefoxLink":"https://addons.mozilla.org/firefox/addon/toster-extension","operaLink":"https://addons.opera.com/extensions/details/toster-extension","latestReleaseLink":"https://github.com/toster-extension/toster-extension/releases/latest"},"title":"Toster Extension","links":{"sidebar":{"Предложить фичу":"https://github.com/toster-extension/toster-extension/issues/new?assignees=yarkovaleksei&labels=feature&template=-----------.md&title=","Сообщить о баге":"https://github.com/toster-extension/toster-extension/issues/new?assignees=yarkovaleksei&labels=bug&template=------.md&title="},"sharing":{"google":true,"facebook":true,"twitter":true}},"gitbook":"3.x.x","description":"Улучшает возможности сайта qna.habr.com, добавляя недостающий функционал, либо изменяя существующий."},"file":{"path":"features/question-page.md","mtime":"2020-01-25T21:50:50.399Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-25T23:12:55.346Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    

    </body>
</html>

